Revit 2026 API

# FabricationPartRouteEnd Properties

---

The FabricationPartRouteEnd type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FabricationPartRouteEnd Class

Autodesk.Revit.DB.Fabrication Namespace